In [421]:
import pandas as pd
import numpy as np
pd.set_option('display.max_rows', 5400)
# pd.options(repr.matrix.max.rows=6000, repr.matrix.max.cols=200)

In [341]:
swis_10 = pd.read_csv('Switz 10.csv')

In [342]:
swis_10.head()

       Date  swis10_yield
0  11/28/05         2.176
1  11/29/05         2.172
2  11/30/05         2.164
3   12/1/05         2.166
4   12/2/05         2.147

In [343]:
swis_10.Date = pd.to_datetime(swis_10.Date)

In [344]:
swis_10.set_index('Date', inplace=True)

In [345]:
swis_10.head()

            swis10_yield
Date
2005-11-28         2.176
2005-11-29         2.172
2005-11-30         2.164
2005-12-01         2.166
2005-12-02         2.147

In [346]:
us_10 = pd.read_csv('US 10-Year 4577.csv')

In [347]:
us_10.head()

      Date  us10_yield
0  8/16/17       2.227
1  8/15/17       2.273
2  8/14/17       2.224
3  8/13/17       2.199
4  8/11/17       2.191

In [348]:
us_10.Date = pd.to_datetime(us_10.Date)

In [349]:
us_10.set_index('Date', inplace=True)

In [350]:
us_10.head()

            us10_yield
Date
2017-08-16       2.227
2017-08-15       2.273
2017-08-14       2.224
2017-08-13       2.199
2017-08-11       2.191

In [351]:
us_10.shape

(4576, 1)

In [352]:
uk_10 = pd.read_csv('Uk10 6514.csv')

In [353]:
uk_10.head()

       Date  uk10_yield
0  1-Nov-93      7.0536
1  2-Nov-93      7.0289
2  3-Nov-93      6.9850
3  4-Nov-93      6.9859
4  5-Nov-93      7.1002

In [354]:
uk_10.Date = pd.to_datetime(uk_10.Date)

In [355]:
uk_10.set_index('Date', inplace=True)

In [356]:
uk_10.head()

            uk10_yield
Date
1993-11-01      7.0536
1993-11-02      7.0289
1993-11-03      6.9850
1993-11-04      6.9859
1993-11-05      7.1002

In [357]:
uk_10.shape

(6013, 1)

In [425]:
swed_10 = pd.read_csv('Sweden 10-Year2997.csv')

In [426]:
swed_10.head()

        Date  swed10_yield
0  16-Aug-17         0.679
1  15-Aug-17         0.675
2  14-Aug-17         0.622
3  11-Aug-17         0.583
4  10-Aug-17         0.000

In [427]:
swed_10.Date = pd.to_datetime(swed_10.Date)

In [428]:
swed_10.set_index('Date', inplace=True)

In [429]:
swed_10.head()

            swed10_yield
Date
2017-08-16         0.679
2017-08-15         0.675
2017-08-14         0.622
2017-08-11         0.583
2017-08-10         0.000

In [430]:
swed_10.shape

(3141, 1)

In [431]:
cad_10 = pd.read_csv('Canada 10-Year2998.csv')

In [432]:
cad_10.head()

        Date  can10_yield
0  16-Aug-17        1.879
1  15-Aug-17        1.907
2  14-Aug-17        1.877
3  11-Aug-17        1.852
4  10-Aug-17        1.852

In [433]:
cad_10.Date = pd.to_datetime(cad_10.Date)

In [434]:
cad_10.set_index('Date', inplace=True)

In [435]:
cad_10.head()

            can10_yield
Date
2017-08-16        1.879
2017-08-15        1.907
2017-08-14        1.877
2017-08-11        1.852
2017-08-10        1.852

In [436]:
cad_10.shape

(3147, 1)

In [370]:
eu_10 = pd.read_csv('EU 10 3323.csv')

In [371]:
eu_10.head()

      Date  eu10_yield
0  8/16/17    0.481420
1  8/15/17    0.473368
2  8/14/17    0.445465
3  8/11/17    0.416112
4  8/10/17    0.444193

In [372]:
eu_10.Date = pd.to_datetime(eu_10.Date)

In [373]:
eu_10.set_index('Date', inplace=True)

In [374]:
eu_10.head()

            eu10_yield
Date
2017-08-16    0.481420
2017-08-15    0.473368
2017-08-14    0.445465
2017-08-11    0.416112
2017-08-10    0.444193

In [375]:
eu_10.shape

(3316, 1)

In [376]:
france_10 = pd.read_csv('France 10-Year 4623.csv')

In [377]:
france_10.head()

        Date  fra10_yield
0  16-Aug-17        0.741
1  15-Aug-17        0.730
2  14-Aug-17        0.704
3  11-Aug-17        0.685
4  10-Aug-17        0.710

In [378]:
france_10.Date = pd.to_datetime(france_10.Date)

In [379]:
france_10.set_index('Date', inplace=True)

In [380]:
france_10.head()

            fra10_yield
Date
2017-08-16        0.741
2017-08-15        0.730
2017-08-14        0.704
2017-08-11        0.685
2017-08-10        0.710

In [381]:
france_10.shape

(4622, 1)

In [382]:
ger_10 = pd.read_csv('Germany 10.csv')

In [383]:
ger_10.head()

       Date  ger10_yield
0  11/28/05        3.418
1  11/29/05        3.467
2  11/30/05        3.455
3   12/1/05        3.407
4   12/2/05        3.397

In [384]:
ger_10.Date = pd.to_datetime(ger_10.Date)

In [385]:
ger_10.set_index('Date', inplace=True)

In [386]:
ger_10.head()

            ger10_yield
Date
2005-11-28        3.418
2005-11-29        3.467
2005-11-30        3.455
2005-12-01        3.407
2005-12-02        3.397

In [387]:
ita_10 = pd.read_csv('Italy 10-Year5000.csv')

In [388]:
ita_10.head()

        Date  ita10_yield
0  16-Aug-17        2.043
1  15-Aug-17        2.049
2  14-Aug-17        2.016
3  11-Aug-17        2.029
4  10-Aug-17        2.031

In [389]:
ita_10.Date = pd.to_datetime(ita_10.Date)

In [390]:
ita_10.set_index('Date', inplace=True)

In [391]:
ita_10.head()

            ita10_yield
Date
2017-08-16        2.043
2017-08-15        2.049
2017-08-14        2.016
2017-08-11        2.029
2017-08-10        2.031

In [392]:
ita_10.shape

(5002, 1)

In [393]:
spain_10 = pd.read_csv('Spain 10-Year3220.csv')

In [394]:
spain_10.head()

        Date  spain10_yield
0  16-Aug-17          1.452
1  15-Aug-17          1.467
2  14-Aug-17          1.430
3  11-Aug-17          1.454
4  10-Aug-17          1.451

In [395]:
spain_10.Date = pd.to_datetime(spain_10.Date)

In [396]:
spain_10.set_index('Date', inplace=True)

In [397]:
spain_10.head()

            spain10_yield
Date
2017-08-16          1.452
2017-08-15          1.467
2017-08-14          1.430
2017-08-11          1.454
2017-08-10          1.451

In [398]:
spain_10.shape

(3219, 1)

In [399]:
aus_10 = pd.read_csv('Australia 10-Year.csv')

In [400]:
aus_10.head()

       Date  aus10_yield
0  11/28/05        5.369
1  11/29/05        5.348
2  11/30/05        5.377
3   12/1/05        5.388
4   12/2/05        5.362

In [401]:
aus_10.Date = pd.to_datetime(aus_10.Date)

In [402]:
aus_10.set_index('Date', inplace=True)

In [403]:
aus_10.head()

            aus10_yield
Date
2005-11-28        5.369
2005-11-29        5.348
2005-11-30        5.377
2005-12-01        5.388
2005-12-02        5.362

In [404]:
aus_10.shape

(3004, 1)

In [405]:
china_10 = pd.read_csv('China 10-Year2900.csv')

In [406]:
china_10.head()

        Date  china10_yield
0  16-Aug-17          3.624
1  15-Aug-17          3.618
2  14-Aug-17          3.631
3  11-Aug-17          3.640
4  10-Aug-17          3.676

In [407]:
china_10.Date = pd.to_datetime(china_10.Date)

In [408]:
china_10.set_index('Date', inplace=True)

In [409]:
china_10.tail()

            china10_yield
Date
2006-05-25          2.958
2006-05-26          2.960
2006-05-29          2.987
2006-05-30          2.987
2006-05-31          2.982

In [410]:
china_10.shape

(2936, 1)

In [437]:
all_yields = us_10.join([uk_10, swis_10, eu_10, cad_10, swed_10, ger_10, france_10, ita_10, spain_10, aus_10, china_10], how='outer')

In [438]:
all_yields.to_csv('all_yields.csv')